Tekla.Structures.Dialog.UIControls.ShapeSelectionForm
The ShapeSelectionForm class represents a dialog to select Shapes
using the Shape catalogs.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.selectedShape
Selected shape.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.startShape
Start shape.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.shapeList
Shape List.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.#ctor(System.Collections.Generic.List{Tekla.Structures.Catalogs.ShapeItem})
Initializes a new instance of the ShapeSelectionForm class.
shapes: The Shapes to be added to the dialog.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.#ctor(System.Collections.Generic.List{Tekla.Structures.Catalogs.ShapeItem},System.String)
Initializes a new instance of the ShapeSelectionForm class, selecting the given Shape in the tree control.
shapes: The Shapes to be added to the dialog.
shape: The Shape to be selected in the tree.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.SelectedShape
Gets or sets the selected Shape in the control.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.StartShape
Gets or sets the selected start shape in the control.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.ShapeList
Gets or sets the shape list in the control.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.OnLoad(System.EventArgs)
When the load event is raised, the tree in the dialog is filled with the Shapes.
The create dialog is only localized when it is not in design mode,
meaning it is shown without localization in Visual Studio.
eventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.FillTreeWithBasedOnFilter(System.String)
Shape list based on filter.
searchText: The search text.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.FillTreeWithShapes(System.Collections.Generic.List{Tekla.Structures.Catalogs.ShapeItem})
Fill tree with shape items.
shapes: The collection name used to search Shape items from the datasource.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.CreateNodeIfNeeded(System.String)
Creates a new node for Shape if needed.
shapeName: The shape name.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.GetShapeItemsContainingText(System.String)
Get Shape item list based on search text.
searchText: The collection name used to search Shape items from the datasource.
Returns: List of Shape items matching criteria.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.CancelClicked(System.Object,System.EventArgs)
Cancel clicked.
sender: The sender.
eventArgs: Event Args.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.OkClicked(System.Object,System.EventArgs)
Ok clicked.
sender: The sender.
eventArgs: Event Args.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.Tree_AfterSelect(System.Object,System.Windows.Forms.TreeViewEventArgs)
Node selected.
sender: The sender.
eventArgs: Event Args.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.FilterTextBox_KeyPress(System.Object,System.Windows.Forms.KeyPressEventArgs)
Key pressed in filter text box.
sender: The sender.
e: Event Args.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.ShapeSelectionForm.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.